DataProcessors/РабочееМестоРаботыСМалоценкой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоРаботыСМалоценкой</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>тчДокументыПрихода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокПрихода</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПриходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриходныйОрдерНаТовары</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРознице</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПолучениюНаСклады</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыПолученные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходныйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПраваПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйДоп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьТТН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияМест</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>флТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.im_ПоставщикиИнтернетМагазина</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратнаяТара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПеремещениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПеремещениеОС</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияОС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МестонахождениеОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизаций</xr:Item>
				<xr:Item>InformationRegister.МестонахождениеОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТретийЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Comment>вместо документа перемещения</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РабочееМестоРаботыСМалоценкой/Forms/Форма/Ext/Form/Module.bsl
// Хранит дерево документов на сервере.
&НаСервере
Перем мДерево;

// Хранит соответствие документов и признак присутствия в списке на сервере.
&НаСервере
Перем мУжеВСписке;

// Хранит соответствие имени документов и их метаданных на сервере.
&НаСервере
Перем мКэшРеквизитовДокумента;

&НаСервере
Перем мКэшПраваДоступаКМетаданным;

&НаСервере
Процедура ОбновитьДанныеПриходаНаСервере()
	// Вставити вміст обробника.
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПрихода(Команда)
	ОбновитьДанныеПриходаНаСервере();
КонецПроцедуры


/////////////////////////////////////////Структура подчинености////////////////////////////////
&НаКлиенте
Процедура ВывестиСтруктуруПодчиненности()
	
	
	Если ДокументСсылка = Неопределено 
		Или ДокументСсылка.Пустая() Тогда
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеДереваДокументов();

КонецПроцедуры

&НаКлиенте
Процедура тчДокументыПриходаПриАктивизацииСтроки(Элемент)
	
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ссылка;
	Исключение
		ДокументСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();	
	КонецПопытки;

	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеДереваДокументов()
	
	ВывестиДеревоДокументов();
	РазвернутьТаблицуДокументов();
		
КонецПроцедуры

&НаСервере
Процедура ВывестиДеревоДокументов()
	
	ДанныеДерева = ДеревоДокументов.ПолучитьЭлементы();
	ДанныеДерева.Очистить();
	
	мДерево = ДанныеДерева;	
	мУжеВСписке.Очистить();
	ВывестиРодительскиеДокументы(ДокументСсылка);
	
	ВывестиПодчиненныеДокументы(мДерево, мКэшПраваДоступаКМетаданным);
	ВывестиПодчинённыеИзТабличныхЧастей(ДокументСсылка);
	
КонецПроцедуры // ВывестиДеревоДокументов()

&НаСервере
Процедура ВывестиПодчиненныеДокументы(СтрокаДерева, мКэшПраваДоступаКМетаданным)
	
	ТекущийДокумент = СтрокаДерева.Ссылка;	
	Таблица = ПолучитьСписокПодчиненныхДокументов(ТекущийДокумент, мКэшПраваДоступаКМетаданным);
	КэшПоТипамДокументов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;			
		ИмяДокумента = МетаданныеДокумента.Имя;
		СинонимДокумента = МетаданныеДокумента.Синоним;
		
		ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента);
		
		СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
		Если СтруктураТипа = Неопределено Тогда
			СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
			КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
		КонецЕсли;
		СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);		
	КонецЦикла;
	
	Если КэшПоТипамДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы УПОРЯДОЧИТЬ ПО ПодчиненныеДокументы.Дата";
	Запрос = Новый Запрос;
	Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "
					|ВЫБРАТЬ ", "
					|ОБЪЕДИНИТЬ ВСЕ
					|ВЫБРАТЬ") + "
					|Дата, Ссылка, Представление, Проведен, ПометкаУдаления, 
					|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["СуммаДокумента"], "СуммаДокумента", "NULL") + " КАК СуммаДокумента,
					|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["ВалютаДокумента"], "ВалютаДокумента", "NULL") + " КАК ВалютаДокумента
					|ИЗ Документ." + КлючИЗначение.Ключ + "
					|ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
					
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = СтрокаДерева;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
			
			НоваяСтрока = СтрокиДерева.Добавить();
			НоваяСтрока.Ссылка 				  = Выборка.Ссылка;
			НоваяСтрока.ДокументПредставление = Выборка.Представление;
			НоваяСтрока.Проведен 			  = Выборка.Проведен;
			НоваяСтрока.ПометкаУдаления 	  = Выборка.ПометкаУдаления;		
			
			// Установим индекс пиктограммы текущего состояния документа.
			УстановитьИндексПиктограммыСостоянияДокументаСервер(НоваяСтрока);
			
			мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
			ВывестиПодчиненныеДокументы(НоваяСтрока,мКэшПраваДоступаКМетаданным);
			
			ТемпДерево = мДерево;
			мДерево    = НоваяСтрока;
			ВывестиПодчинённыеИзТабличныхЧастей(НоваяСтрока.Ссылка);
			мДерево = ТемпДерево;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиПодчиненныеДокументы()

&НаСервере
Процедура ВывестиПодчинённыеИзТабличныхЧастей(ДокументСсылка)

	РеквизитыТчПодчинённые = Ложь;
		
	Если Не РеквизитыТчПодчинённые Тогда
		Возврат;
	КонецЕсли;
		
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов 	= Новый СписокЗначений;
	МетаданныеДокументы = Метаданные.Документы;
	
	ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы);
    ВывестиБезРодителей(СписокРеквизитов, Истина);

КонецПроцедуры // ВывестиПодчинённыеИзТабличныхЧастей()

&НаСервере
Процедура ВывестиРодительскиеДокументы(ДокументСсылка)
	
	МетаданныеДокумента 	= ДокументСсылка.Метаданные();
	СписокРеквизитов 		= Новый СписокЗначений;
	МетаданныеДокументы 	= Метаданные.Документы; 
	мКэшМетаданныеРеквизита = Новый соответствие;
	
	РеквизитыТчПодчинённые = Ложь;
	ИмяТабЧастиРодителя    = ПолучитьИмяТабличнойЧастиДляПоискаРодителя(ДокументСсылка);
	
	ДополнитьСписокДокументовПоРеквизитам(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы, мКэшМетаданныеРеквизита);
	Если Не РеквизитыТчПодчинённые Тогда 		
		ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы);		
	КонецЕсли; // если надо выводить реквизиты табличной части в качестве родителей
	Если СписокРеквизитов.Количество() = 0 И ИмяТабЧастиРодителя <> Неопределено Тогда
		ДобавитьСтрокуРодителя(СписокРеквизитов, ДокументСсылка, ИмяТабЧастиРодителя);	
	КонецЕсли;
		
	СписокРеквизитов.СортироватьПоПредставлению();
	мУжеВСписке.Вставить(ДокументСсылка, Истина);
	
	Если СписокРеквизитов.Количество() = 1 Тогда
		ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		ВывестиБезРодителей(СписокРеквизитов);		
	КонецЕсли;

	Если ТипЗнч(мДерево) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокаДерева = мДерево.ПолучитьЭлементы().Добавить();
	Иначе
		СтрокаДерева = мДерево.Добавить();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
						   | ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
						   
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
	КонецЕсли;
	
	Выборка  = Запрос.Выполнить().Выбрать();
	ЕСли Выборка.Следующий() Тогда		
		
		СтрокаДерева.Ссылка   		 = Выборка.Ссылка;
		СтрокаДерева.Проведен 		 = Выборка.Проведен;
		СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		
		УстановитьИндексПиктограммыСостоянияДокументаСервер(СтрокаДерева);
		
		СтрокаДерева.ДокументПредставление = Выборка.Представление;
		
	Иначе
		
		СтрокаДерева.Ссылка = ДокументСсылка;
		СтрокаДерева.ДокументПредставление = Строка(ДокументСсылка);
		
	КонецЕсли;
	
	мДерево = СтрокаДерева;
		
КонецПроцедуры // ВывестиРодительскиеДокументы()

Функция ПолучитьСписокПодчиненныхДокументов(ДокументОснование, мКэшПраваДоступаКМетаданным, ИмяКритерия = "СвязанныеДокументы") Экспорт
		
	ТекстЗапроса = "";
	
	ТаблицаДокументов 	 = Новый ТаблицаЗначений;
	ТипДокументОснование = ТипЗнч(ДокументОснование);
	СоставКритерия		 = Метаданные.КритерииОтбора[ИмяКритерия].Состав;
	
	Для Каждого ЭлементСостава ИЗ СоставКритерия Цикл
		
		Если Не ЭлементСостава.Тип.СодержитТип(ТипДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = РазобратьПутьКОбъектуМетаданных(ПутьКДанным
																				   ,мКэшПраваДоступаКМетаданным);
		Если Не СтруктураПутьКДанным.ЕстьДоступКМетаданным Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		
		ТекущаяСтрокаГДЕ = "ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." 
						   + СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
			
		ИмяТЧ 		 = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ОБЪЕДИНИТЬ
					   |ВЫБРАТЬ") + "
					   |" + СтруктураПутьКДанным.ВидОбъекта   + ".Ссылка ИЗ " + ИмяОбъекта 						+ "."
					      + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " 	  + СтруктураПутьКДанным.ВидОбъекта + "
					   |" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
					   |";
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ТаблицаДокументов = РезультатЗапроса.Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ПолучитьСписокПодчиненныхДокументов()

&НаСервереБезКонтекста
Процедура ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента)
	
	РеквизитыДокумента = мКэшРеквизитовДокумента[ИмяДокумента];
	
	Если РеквизитыДокумента = Неопределено Тогда
		
		РеквизитыДокумента = Новый Соответствие;		
		РеквизитыДокумента.Вставить("СуммаДокумента" , МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента")  <> Неопределено);
		РеквизитыДокумента.Вставить("ВалютаДокумента", МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено);		
		
		мКэшРеквизитовДокумента.Вставить(ИмяДокумента, РеквизитыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура УстановитьИндексПиктограммыСостоянияДокументаСервер(ДанныеТекущейСтроки)
	
	// Установим индекс пиктограммы текущего состояния документа:
	// 0 - Проведен
	// 1 - помечен на удаление
	// 2 - непроведен
	
	Если ДанныеТекущейСтроки.Проведен Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 0;
		
	ИначеЕсли ДанныеТекущейСтроки.ПометкаУдаления Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 1;
		
	Иначе
		ДанныеТекущейСтроки.ИндексПиктограммы = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы)

	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);				
				Если МетаданныеРеквизита<>Неопределено И МетаданныеДокументы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;						
			КонецЦикла;
		КонецЦикла;
		
		Попытка
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Исключение
		КонецПопытки;
		
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					 И МетаданныеДокументы.Содержит(МетаданныеЗначения)
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
			
КонецПроцедуры // ДополнитьСписокДокументовПоТабличнымЧастям()

&НаСервере
Процедура ВывестиБезРодителей(СписокДокументов, ВывестиПодчиненные = Ложь)
	
	Если ТипЗнч(мДерево) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДерева = мДерево.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = мДерево;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		МетаданныеДокумента = ЭлементСписка.Значение.Метаданные();
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
		| ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементСписка.Значение);
		
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
		КонецЕсли;
		
		Выборка  = Запрос.Выполнить().Выбрать();
		ЕСли Выборка.Следующий() Тогда		
			
			Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
				
	            СтрокаДерева = СтрокиДерева.Добавить();
				СтрокаДерева.Ссылка= Выборка.Ссылка;
				СтрокаДерева.Проведен = Выборка.Проведен;
				СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
				
				// Установим индекс пиктограммы текущего состояния документа.
				УстановитьИндексПиктограммыСостоянияДокументаСервер(СтрокаДерева);
				
				СтрокаДерева.ДокументПредставление = Выборка.Представление;
				мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
				
				Если ВывестиПодчиненные Тогда
					ВывестиПодчиненныеДокументы(СтрокаДерева, мКэшПраваДоступаКМетаданным);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;

	мДерево = СтрокаДерева;
	
КонецПроцедуры // ВывестиБезРодителей()

&НаСервере
Функция ПолучитьИмяТабличнойЧастиДляПоискаРодителя(ДокументСсылка)

			ИмяТабЧастиРодителя = Неопределено;	
		
	
	Возврат ИмяТабЧастиРодителя;
	
КонецФункции // ПолучитьИмяТабличнойЧастиДляПоискаРодителя()

&НаСервере
Процедура ДополнитьСписокДокументовПоРеквизитам(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы, мКэшМетаданныеРеквизита)

	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = мКэшМетаданныеРеквизита.Получить(ТекущийТип);
			Если МетаданныеРеквизита = неопределено Тогда
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				мКэшМетаданныеРеквизита.Вставить(ТекущийТип,МетаданныеРеквизита);
			КонецЕсли;
					
			Если МетаданныеРеквизита<>Неопределено 
				 И МетаданныеДокументы.Содержит(МетаданныеРеквизита) 
				 И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
					Исключение
						 ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли;			
			
		КонецЦикла;
	КонецЦикла;	
		
КонецПроцедуры // ДополнитьСписокДокументовПоРеквизитам()

&НаСервере
Процедура ДобавитьСтрокуРодителя(СписокРеквизитов, ДокументСсылка, ИмяТабЧастиРодителя)

	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ДопУсловияПоДоговоруТч.Ссылка,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.Проведен,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.ПометкаУдаления,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.Представление,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.ВалютаДокумента,
	|	NULL КАК СуммаДокумента
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору." + ИмяТабЧастиРодителя + " КАК бит_ДопУсловияПоДоговоруТч
	|ГДЕ
	|	бит_ДопУсловияПоДоговоруТч.ДокументПланирования = &ДокументПланирования
	|";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаДокумент = Выборка.Ссылка;
		ВывестиРодительскиеДокументы(СсылкаНаДокумент);
				
	КонецЦикла;
	
КонецПроцедуры // ДобавитьСтрокуРодителя()

Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным, мКэшПраваДоступаКМетаданным) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	ЕстьДоступКМетаданным = мКэшПраваДоступаКМетаданным.Получить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта);
	Если ЕстьДоступКМетаданным = неопределено Тогда
		Если Структура.ТипОбъекта = "Документ" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Документы[Структура.ВидОбъекта]);
		ИначеЕсли Структура.ТипОбъекта = "Задача" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Задачи[Структура.ВидОбъекта]);
		Иначе
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Справочники[Структура.ВидОбъекта]);
		КонецЕсли;
	КонецЕсли;                                                          
	
	Структура.Вставить("ЕстьДоступКМетаданным", ЕстьДоступКМетаданным);
	мКэшПраваДоступаКМетаданным.Вставить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта,ЕстьДоступКМетаданным);        
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()

&НаКлиенте
Процедура РазвернутьТаблицуДокументов()

	ЭлементыДерева = ДеревоДокументов.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыДерева Цикл

		Элементы.ДеревоДокументов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриходаПриАктивизацииСтроки(Элемент)
	
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ДокументыПриходаСсылка;
	Исключение
		ДокументСсылка = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();	
	КонецПопытки;

	ВывестиСтруктуруПодчиненности();
	УстановитьОтборДинамическогоСписка(ДокументСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияПриАктивизацииСтроки(Элемент)
	
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ссылка;
	Исключение
		ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();	
	КонецПопытки;

	ВывестиСтруктуруПодчиненности();
	УстановитьОтборДинамическогоСпискаПоступления(ДокументСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ОткрытьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент()
	
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ДанныеТекущейСтроки.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Поступления(Команда)
	
	Если Элементы.ДокументыПоступления.Видимость Тогда 
		Элементы.ДокументыПоступления.Видимость = Ложь;
		ДокументыПоступления.Отбор.Элементы.Очистить();
		Элементы.ДокВводОС.Видимость = Ложь;
		ДокВводОС.Отбор.Элементы.Очистить();
	Иначе
		Элементы.ДокументыПоступления.Видимость = Истина;
		Элементы.ДокВводОС.Видимость 	= Истина;
	КонецЕсли;
	
	Элементы.Поступления.Пометка = Элементы.ДокументыПоступления.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура Приходные(Команда)
	
	Если Элементы.ДокументыПрихода.Видимость Тогда 
		Элементы.ДокументыПрихода.Видимость = Ложь;
		ДокументыПрихода.Отбор.Элементы.Очистить();
		Элементы.ДокументыПеремещенияОС.Видимость = Ложь;
		ДокументыПеремещенияОС.Отбор.Элементы.Очистить();;
		Элементы.ДокументыПередачаМалоценки.Видимость = Ложь;
		ДокументыПередачаМалоценки.Отбор.Элементы.Очистить();
		
	Иначе
		Элементы.ДокументыПрихода.Видимость 			= Истина;
		Элементы.ДокументыПеремещенияОС.Видимость 		= Истина;
		Элементы.ДокументыПередачаМалоценки.Видимость 	= Истина;
	КонецЕсли;
	
	Элементы.Приходные.Пометка = Элементы.ДокументыПрихода.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЦепочкуДокументовПриходНаСервере()
	
	ДокПриходный = Элементы.ДокументыПрихода.ТекущаяСтрока;
	
	Данные = ПолучитьСписокПодчиненныхДокументов(ДокПриходный, мКэшПраваДоступаКМетаданным);
	
	Для Каждого Док из Данные Цикл
		
		Если ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			СоздатьЦепочкуДокументовПеремещенияОС(Док.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЦепочкуДокументовПриход(Команда)
	СоздатьЦепочкуДокументовПриходНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЦепочкуДокументовПередачаОС(Команда)
	СоздатьЦепочкуДокументовПередачаНаСервере();		
КонецПроцедуры

&НаСервере
Процедура СоздатьЦепочкуДокументовПередачаНаСервере()
	
	ДокПриходный = Элементы.ДокументыПрихода.ТекущаяСтрока;
	
	Данные = ПолучитьСписокПодчиненныхДокументов(ДокПриходный, мКэшПраваДоступаКМетаданным);
	
	Для Каждого Док из Данные Цикл
		
		Если ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			СоздатьЦепочкуДокументовПередачаОСНаСервере(Док.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЦепочкуДокументовПеремещенияОС(ДокПеремещения)
	
	НачатьТранзакцию();
	//Распроведем док перемещения			
	ДокПеремещенияОб = ДокПеремещения.ПолучитьОбъект();
	Попытка
		ДокПеремещенияОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Исключение
		Сообщить(ОписаниеОшибки());	
		ОтменитьТранзакцию();
	КонецПопытки;
	
	СкладПолучатель 	= ДокПеремещения.СкладПолучатель;
	СкладОтправитель 	= ДокПеремещения.СкладОтправитель;
	
	//Создаем вместо перемещения - документ ОС
	ДокПеремещениеОС = Документы.ПеремещениеОС.СоздатьДокумент();
	
	ДокПеремещениеОС.Дата 			= ТекущаяДата();
	ДокПеремещениеОС.Организация 	= ДокПеремещения.Организация;
	ДокПеремещениеОС.Ответственный  = ПараметрыСеанса.ТекущийПользователь;
	ДокПеремещениеОС.Подразделение 	= СкладПолучатель.Подразделение;
	ДокПеремещениеОС.МОЛОрганизации = ПолучитьОтветственноеЛицо(ДокПеремещения.Организация);
	ДокПеремещениеОС.СобытиеОС		= Справочники.СобытияОС.НайтиПоНаименованию("Внутреннее перемещение", Истина);
	ДокПеремещениеОС.Сдал			= ПолучитьОтветственноеЛицо(СкладОтправитель);
	ДокПеремещениеОС.Принял			= ПолучитьОтветственноеЛицо(СкладПолучатель);;
	
	ДокПеремещениеОС.ОтражатьВБухгалтерскомУчете 	= Истина;
	ДокПеремещениеОС.ОтражатьВУправленческомУчете 	= Истина;
	ДокПеремещениеОС.ДокументПеремещения			= ДокПеремещения;
	
	ДокПеремещениеОС.ОС.Загрузить(ПолучитьОС(ДокПеремещения.Товары.Выгрузить(,"Номенклатура")));
	
	Попытка
		ДокПеремещениеОС.Записать(РежимЗаписиДокумента.Запись);
		Сообщить(ОписаниеОшибки());
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();	
	КонецПопытки;
	
	Элементы.ДокументыПеремещенияОС.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЦепочкуДокументовПередачаОСНаСервере(ДокПеремещения)
	
	НачатьТранзакцию();
	//Распроведем док перемещения			
	ДокПеремещенияОб = ДокПеремещения.ПолучитьОбъект();
	Попытка
		ДокПеремещенияОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Исключение
		Сообщить(ОписаниеОшибки());	
		ОтменитьТранзакцию();
	КонецПопытки;
	
	СкладПолучатель 	= ДокПеремещения.СкладПолучатель;
	СкладОтправитель 	= ДокПеремещения.СкладОтправитель;
	
	//Создаем вместо перемещения - документ ОС
	ДокПеремещениеОС = Документы.ПередачаМалоценкиВЭксплуатацию.СоздатьДокумент();
	
	ДокПеремещениеОС.Дата 			= ТекущаяДата();
	ДокПеремещениеОС.Организация 	= ДокПеремещения.Организация;
	ДокПеремещениеОС.Ответственный  = ПараметрыСеанса.ТекущийПользователь;
	ДокПеремещениеОС.Подразделение 	= СкладПолучатель.Подразделение;
	//ДокПеремещениеОС.МОЛОрганизации = ПолучитьОтветственноеЛицо(ДокПеремещения.Организация);
	//ДокПеремещениеОС.СобытиеОС		= Справочники.СобытияОС.НайтиПоНаименованию("Внутреннее перемещение", Истина);
	//ДокПеремещениеОС.Сдал			= ПолучитьОтветственноеЛицо(СкладОтправитель);
	//ДокПеремещениеОС.Принял			= ПолучитьОтветственноеЛицо(СкладПолучатель);;
	
	ДокПеремещениеОС.ОтражатьВБухгалтерскомУчете 	= Истина;
	ДокПеремещениеОС.ОтражатьВУправленческомУчете 	= Истина;
	ДокПеремещениеОС.ДокументПеремещения			= ДокПеремещения;
	
	ДокПеремещениеОС.МалоценныеАктивы.Загрузить(ПолучитьМалоценку(ДокПеремещения.Товары.Выгрузить(,"Номенклатура")));
	
	Сообщить("ок");
	Попытка
		ДокПеремещениеОС.Записать(РежимЗаписиДокумента.Запись);
		Сообщить(ОписаниеОшибки());
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();	
		Сообщить("Ошибка");
	КонецПопытки;
	
	Элементы.ДокументыПередачаМалоценки.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ссылка)
	
	ВсеПеремещения = ПолучитьВсеПеремещенияПоПриходному(ссылка);

	ДокументыПеремещенияОС.Отбор.Элементы.Очистить();	
	
	НовЭлементОтбора 			    = ДокументыПеремещенияОС.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументПеремещения"); 
	НовЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	НовЭлементОтбора.Использование  = Истина;
	НовЭлементОтбора.ПравоеЗначение = ?(ВсеПеремещения.Количество() > 0, ВсеПеремещения, Неопределено);
	
	ДокументыПередачаМалоценки.Отбор.Элементы.Очистить();
	
	НовЭлементОтбора 			    = ДокументыПередачаМалоценки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументПеремещения"); 
	НовЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	НовЭлементОтбора.Использование  = Истина;
	НовЭлементОтбора.ПравоеЗначение = ?(ВсеПеремещения.Количество() > 0, ВсеПеремещения, Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСпискаПоступления(ссылка)
	
	ДокВводОС.Отбор.Элементы.Очистить();	
	
	НовЭлементОтбора 			    = ДокВводОС.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументПоступления"); 
	НовЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	НовЭлементОтбора.Использование  = Истина;
	НовЭлементОтбора.ПравоеЗначение = ссылка;
	
КонецПроцедуры

Функция ПолучитьОС(Номенклатура) 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводВЭксплуатациюОСОС.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	Документ.ВводВЭксплуатациюОС.ОС КАК ВводВЭксплуатациюОСОС
		|ГДЕ
		|	ВводВЭксплуатациюОСОС.Ссылка.Проведен
		|	И НЕ ВводВЭксплуатациюОСОС.Ссылка.ПометкаУдаления
		|	И ВводВЭксплуатациюОСОС.Ссылка.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьМалоценку(Номенклатура) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводВЭксплуатациюОСОС.ОсновноеСредство КАК Номенклатура
		|ИЗ
		|	Документ.ВводВЭксплуатациюОС.ОС КАК ВводВЭксплуатациюОСОС
		|ГДЕ
		|	ВводВЭксплуатациюОСОС.Ссылка.Проведен
		|	И НЕ ВводВЭксплуатациюОСОС.Ссылка.ПометкаУдаления
		|	И ВводВЭксплуатациюОСОС.Ссылка.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьВсеПеремещенияПоПриходному(Приходный)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка КАК ДокументПеремещения
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	НЕ ПеремещениеТоваров.ПометкаУдаления
		|	И ПеремещениеТоваров.ДокументОснование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Приходный);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтветственноеЛицо(Склад)
	
	Отбор = Новый Структура("СтруктурнаяЕдиница");
	Отбор.СтруктурнаяЕдиница = Склад;
	СрезПоследних = РегистрыСведений.ОтветственныеЛица.СрезПоследних(ТекущаяДата(), Отбор);

	Если СрезПоследних.Количество() < 1 Тогда
		Возврат Неопределено;
	Иначе
		Возврат СрезПоследних[0].ФизическоеЛицо;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьДокументНаСервере();

	ТекПоступление = Элементы.ДокументыПоступления.ТекущаяСтрока;
	
	ДокВводОСОБ = Документы.ВводВЭксплуатациюОС.СоздатьДокумент();
	ДокВводОСОБ.Заполнить(ТекПоступление);
	ДокВводОСОБ.Дата = ТекущаяДата();
	
	ДокВводОСОБ.Записать();
	
	Возврат ДокВводОСОБ.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура СоздатьВводОС(Команда)
	
	ДокВвод = ЗаполнитьДокументНаСервере();
	
	ПарамОткрытия = Новый Структура("Ключ", ДокВвод);
	Форм = ПолучитьФорму("Документ.ВводВЭксплуатациюОС.ФормаОбъекта", ПарамОткрытия);
	Форм.Открыть();
	
	Элементы.ДокВводОС.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПриАктивизацииСтроки(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТоварыНаСервере(ДанныеТекущейСтроки.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыНаСервере(Док)
	
	тчТовары.Загрузить(Док.Товары.Выгрузить());
	
КонецПроцедуры

мУжеВСписке 				= Новый Соответствие;
мКэшРеквизитовДокумента 	= Новый Соответствие;
мКэшПраваДоступаКМетаданным	= Новый Соответствие;
